app/controllers/groups_controller.rb

  def update
    if @group.update(group_params)
---
UPDATE `groups` SET `name` = 'こんばんは！', `updated_at` = '2018-04-24 09:49:04' WHERE `groups`.`id` = 1